/*
   2023年2月9日22点19分
   补码
   
 */
#include <stdio.h>
#include<stdlib.h> 
int main()
{
  
    int i = -3;
    printf("%#X\n", i);  //以十六进制输出
    int j = -1;
    printf("%#X\n", j);
    int k = -100;
    printf("%#X\n", k);
    int x = 0xfffffff5;
    printf("%d\n", x);
    char ch = 0x80;
    printf("%d %d\n", ch,sizeof(ch));  //char类型占一个字节八位
    char zh = 128;            //128的二进制为1000 0000 要为正得补零，但是char类型只有八位不能补零了，
    printf("%d\n", zh);
    system("pause");          //只能输出8位补的数字没算进来，所以1000 0000首数字为1为负数即-128
   
    return 0;
}
/* 
   （+3）    0000....0011  【int有4个字节4*8=32位】
   （-3）    1111....1101  【32位】 即1111四个一组对应十六进制的F
                                      1101对应的是十六进制中的D
   （+1）   0000....0001   【32位】
   （-1）   1111....1111   【32位】


         (100)  =  (64)   =  (0110 0100)
              10       16               2
        
        0110 0100按位取反为1001 1011加一为1001 1100
    
    （-100）  1111....1001 1100   前边有6个F  
    （+100）  0000....0110 0100
 */
/* 
   在此编译器中运行结果为：
0XFFFFFFFD            0X表示以十六进制输出
0XFFFFFFFF              
0XFFFFFF9C
-11 
-128 1  
-128             
请按任意键继续. . .


 */