/*
   2023年2月10日17点32分
   &运算符
   
   
 */
#include <stdio.h>
#include<stdlib.h> 
int main()
{
    int i = 5;  //5的二进制代码0101
    int j = 7;  //7的二进制代码0111
    int k;
               
    k = i & j;  //相当于把i和j二进制的每一位进行真假判断
                //           0 1 0 1
                //           0 1 1 1
                //          ——————————
                //           0 1 0 1      即十进制的5
    printf("%d\n", k);

    k = i && j;
    printf("%d\n", k); //k的值只能是1或0， 因为&&是逻辑运算符，逻辑运算符的结果只能是真或假
                       //再C中，真用1表示，假用0表示


    int a = 21;  //21的二进制代码0001 0101
    int b = 7;   //7的二进制代码0111
    int c;
    c = a & b;  //相当于把a和b二进制的每一位进行真假判断
                //       0 0 0 1   0 1 0 1
                //       0 0 0 0   0 1 1 1
                //      ————————————————————
                //       0 0 0 0   0 1 0 1   即十进制的5
    printf("%d\n", c);
            
    system("pause");
    return 0;
}
/* 
在此编译器中结果为：
5
1
5
请按任意键继续. . .


 */

